In [ ]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns 
np.random.seed(50)
data={"House_ID": [1, 2, 3, 4, 4, 5, 6, 7, 8, 9],
    "Size_sqft": [1000, 1500, np.nan, 1800, 1800, 2500, 3000, 3500, 100000, 4000],
    "Bedrooms": [2, 3, 3, np.nan, 4, 5, "four", 6, 7, 8],
    "Age_years": [5, 10, 15, 20, 25, 30, 35, None, 200, 45],
    "Price": [200000, 300000, 350000, 400000, 420000, np.nan, 600000, 700000, 8000000, 900000]

}
df=pd.DataFrame(data)
print(df)

   House_ID  Size_sqft Bedrooms  Age_years      Price
0         1     1000.0        2        5.0   200000.0
1         2     1500.0        3       10.0   300000.0
2         3        NaN        3       15.0   350000.0
3         4     1800.0      NaN       20.0   400000.0
4         4     1800.0        4       25.0   420000.0
5         5     2500.0        5       30.0        NaN
6         6     3000.0     four       35.0   600000.0
7         7     3500.0        6        NaN   700000.0
8         8   100000.0        7      200.0  8000000.0
9         9     4000.0        8       45.0   900000.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   House_ID   10 non-null     int64
 1   Size_sqft  9 non-null      float64
 2   Bedrooms   9 non-null      object
 3   Age_years  9 non-null      float64
 4   Price      9 non-null      float64
dtypes: float64(3), int64(1), object(1)
memory usage: 532.0+ bytes

In [4]:
df.describe()

        House_ID      Size_sqft   Age_years         Price
count  10.000000       9.000000    9.000000  9.000000e+00
mean    4.900000   13233.333333   42.777778  1.318889e+06
std     2.601282   32552.150467   60.265616  2.514798e+06
min     1.000000    1000.000000    5.000000  2.000000e+05
25%     3.250000    1800.000000   15.000000  3.500000e+05
50%     4.500000    2500.000000   25.000000  4.200000e+05
75%     6.750000    3500.000000   35.000000  7.000000e+05
max     9.000000  100000.000000  200.000000  8.000000e+06

In [5]:
df.isnull().sum()

House_ID     0
Size_sqft    1
Bedrooms     1
Age_years    1
Price        1
dtype: int64

In [7]:
df=df.drop_duplicates()
df

   House_ID  Size_sqft Bedrooms  Age_years      Price
0         1     1000.0        2        5.0   200000.0
1         2     1500.0        3       10.0   300000.0
2         3        NaN        3       15.0   350000.0
3         4     1800.0      NaN       20.0   400000.0
4         4     1800.0        4       25.0   420000.0
5         5     2500.0        5       30.0        NaN
6         6     3000.0     four       35.0   600000.0
7         7     3500.0        6        NaN   700000.0
8         8   100000.0        7      200.0  8000000.0
9         9     4000.0        8       45.0   900000.0

In [9]:
df["Bedrooms"]=pd.to_numeric(df["Bedrooms"],errors="coerce")

In [10]:
df["Size_sqft"]=df["Size_sqft"].fillna(df["Size_sqft"].median())

In [11]:
Q1=df["Price"].quantile(0.25)
Q3=df["Price"].quantile(0.75)
IQR=Q3-Q1
df = df[(df["Price"] >= Q1 - 1.5*IQR) & (df["Price"] <= Q3 + 1.5*IQR)]

In [13]:
sns.heatmap(df.corr(),annot=True,cmap="coolwarm")
plt.show()

NameError: name 'sns' is not defined